# -*- coding: utf-8 -*-
# File: config.py

import numpy as np
import os
import pprint

__all__ = ['config', 'finalize_configs']

class AttrDict():
    def __getattr(self, name):
        ret = AttrDict()
        setattr(self, name, ret)
        return ret

    def __str__(self):
        return pprint.format(self.to_dict(), indent=1)

    __repr = __str__

    def to_dict(self):
        """Convert to a nested dict. """
        return {k: v.to_dict() if isinstance(v, AttrDict) else v
                for k, v in self.__dict__items()}

    def update_args(self, args):
        """Update from command line args"""
        for cfg in args:
            keys, v = cfg.split('=', maxsplit=1)
            keylist = keys.split('.')

            dic = self
            for i, k in enumerate(keylist[:-1]):
                assert k in dir(dic), "Unknown config key: {}".format(keys)
                dic = getattr(dic, k)
            key = keylist[-1]

            oldv = getattr(dic, key)
            if not isinstance(oldv, str):
                v = eval(v)
            setattr(dic, key, v)

    # avoid silent bugs
    def __eq__(self, _):
        raise NotImplementedError()

    def __ne__(self, _):
        raise NotImplementedError()

config = AttrDict()
_C = config # short alias

_C.user_COLUMNS = ['user_id', 'follow_count','fans_count','gender','birthday','location',\
               'level','post_count','car_liked','registration_time','properties',\
               'mileage','post','cars','gas_mileage','car_friend_zone',\
               'label']

_C.dict_gender = {'man':1, 'woman':0}
_C.LOCATIONS = ['江西 宜春', '甘肃 白银', '广东 东莞', '广东 广州', '北京 ', '山东 临沂', '湖北 武汉', '吉林 ',
       '安徽 合肥', '山东 东营', '湖南 长沙', '浙江 嘉兴', '浙江 杭州', '江苏 南京', '广东 深圳',
       '重庆 ', '山西 太原', '内蒙古 鄂尔多斯', '天津 ', '四川 成都', '江苏 扬州', '福建 厦门',
       '江苏 无锡', '浙江 宁波', '江苏 南通', '山东 济南', '贵州 贵阳', '河北 廊坊', '湖南 衡阳',
       '四川 达州', '山东 淄博', '上海 ', '山东 青岛', '广东 惠州', '云南 昆明', '湖南 娄底',
       '陕西 西安', '江苏 苏州', '福建 福州', '河北 邢台', '四川 德阳', '安徽 安庆', '湖南 株洲',
       '江苏 淮安', '湖南 怀化', '山东 烟台', '安徽 宣城', '河北 石家庄', '香港 ', '福建 莆田',
       '河南 郑州', '广西 来宾', '辽宁 沈阳', '山西 大同', '山东 威海', '江西 南昌', '浙江 温州',
       '河北 邯郸', '广西 柳州', '台湾 ', '辽宁 大连', '广西 南宁', '山西 运城', '吉林 长春',
       '湖北 黄冈', '河南 新乡', '江苏 盐城', '黑龙江 哈尔滨', '浙江 金华', '湖南 郴州', '河南 开封',
       '广东 佛山', '四川 资阳', '山西 长治', '山东 潍坊', '内蒙古 兴安盟', '浙江 绍兴', '吉林 四平',
       '云南 玉溪', '广西 梧州', '贵州 遵义', '江苏 泰州', '四川 绵阳', '江西 赣州', '黑龙江 大庆',
       '河南 商丘', '广东 中山', '山东 菏泽', '江西 景德镇', '江西 新余', '浙江 湖州', '辽宁 辽阳',
       '安徽 六安', '山东 莱芜', '安徽 铜陵', '宁夏 银川', '江苏 连云港', '安徽 阜阳', '河北 保定',
       '福建 泉州', '澳门 ', '四川 乐山', '安徽 滁州', '广东 珠海', '广东 汕头', '内蒙古 乌兰察布',
       '内蒙古 呼和浩特', '河北 沧州', '内蒙古 呼伦贝尔', '山东 泰安', '湖南 益阳', '广东 阳江',
       '福建 南平', '内蒙古 赤峰', '山西 晋城', '陕西 咸阳', '湖南 常德', '湖南 永州', '江西 上饶',
       '四川 南充', '湖北 宜昌', '浙江 台州', '新疆 喀什', '安徽 蚌埠', '福建 漳州', '安徽 马鞍山',
       '河北 承德', '广东 韶关', '辽宁 丹东', '浙江 舟山', '浙江 衢州', '贵州 六盘水', '江苏 常州',
       '黑龙江 佳木斯', '贵州 铜仁', '江西 九江', '海南 海口', '浙江 丽水', '云南 西双版纳', '湖北 荆州',
       '安徽 芜湖', '新疆 哈密', '湖南 湘潭', '广西 贵港', '河南 周口', '云南 曲靖', '江苏 镇江',
       '山东 聊城', '江苏 徐州', '湖南 岳阳', '云南 文山', '云南 保山', '广东 云浮', '江西 抚州',
       '广东 清远', '广西 桂林', '吉林 延边', '河南 驻马店', '新疆 克拉玛依', '黑龙江 齐齐哈尔',
       '广东 梅州', '甘肃 兰州', '辽宁 盘锦', '新疆 乌鲁木齐', '安徽 淮北', '陕西 榆林', '青海 西宁',
       '安徽 宿州', '福建 三明', '广东 揭阳', '湖北 襄阳', '江西 萍乡', '西藏 拉萨', '湖北 黄石',
       '河南 安阳', '江苏 宿迁', '河北 衡水', '广东 肇庆', '广西 玉林', '辽宁 鞍山', '四川 眉山',
       '新疆 巴音郭楞', '山东 日照', '辽宁 铁岭', '河南 南阳', '山西 晋中', '辽宁 营口', '云南 昭通',
       '吉林 松原', '辽宁 朝阳', '河南 信阳', '河北 唐山', '河南 洛阳', '山东 济宁', '陕西 宝鸡',
       '贵州 安顺', '河南 焦作', '山东 滨州', '广东 潮州', '云南 德宏', '贵州 黔南', '山西 吕梁',
       '广东 茂名', '安徽 亳州', '甘肃 平凉', '内蒙古 巴彦淖尔', '河南 鹤壁', '吉林 白城', '贵州 黔西南',
       '湖南 邵阳', '云南 普洱', '四川 泸州', '四川 广安', '内蒙古 其它', '海外 ', '陕西 渭南',
       '四川 宜宾', '四川 内江', '贵州 毕节', '湖南 湘西', '辽宁 葫芦岛', '江西 鹰潭', '湖北 孝感',
       '四川 广元', '广东 湛江', '甘肃 武威', '河北 张家口', '湖北 荆门', '贵州 黔东南', '山东 枣庄',
       '广西 防城港', '内蒙古 通辽', '湖北 恩施', '广西 北海', '四川 雅安', '广东 江门', '河北 秦皇岛',
       '内蒙古 包头', '河南 三门峡', '河南 平顶山', '山西 朔州', '河南 漯河', '辽宁 抚顺', '辽宁 本溪',
       '山西 忻州', '陕西 安康', '河南 许昌', '四川 遂宁', '新疆 伊犁', '青海 海西', '广西 钦州',
       '河南 濮阳', '黑龙江 鸡西', '四川 自贡', '广东 河源', '云南 红河', '安徽 黄山', '湖北 潜江',
       '新疆 阿克苏', '广东 汕尾', '辽宁 锦州']
_C.PROPERTIES = ['普通用户', '关禁闭', 'SLS赛威论坛版主', '捷豹F-PACE论坛版主', '编辑', '捷豹XF/XFL论坛版主']

_C.CARS_LIKE = ['宝马5系', '奥迪A6L', '帝豪GS', '比亚迪S7', '捷豹XFL', '保时捷911', '揽胜极光',
       '雷克萨斯LS', '景程', '迈锐宝', '卡罗拉', '领克01', '捷豹XF', '宝马X6', '瑞虎7', '蒙迪欧',
       'WEYVV7', '宝马3系', '奔驰C级', 'Mustang', '致悦', '宝马X5', '捷豹XEL', '途观L',
       '速腾', '科迈罗', '朗逸', '汉兰达', '凯越', '比亚迪G3', '思域', '奔驰CLA级', '凯美瑞',
       '英朗', '博越', '奥迪Q5', '杰德', '帝豪', '吉利GX7', '锐界', '唐新能源', '捷豹F-PACE',
       'Macan', 'DS5', '天籁', '艾瑞泽5', '捷豹F-TYPE', 'RAV4荣放', '雷克萨斯RCF',
       'Panamera', '奥迪A7', '名爵ZS', '自由侠', '奔驰GLC', '奔驰B级', '本田CR-V',
       '凯迪拉克ATS-L', '捷豹XJ', '宝马7系', 'MINI', '福克斯', '瑞风S3', '丰田86',
       '英菲尼迪QX70', 'Giulia', '帕杰罗(进口)', '酷威', '英菲尼迪Q70', '骐达', '荣威Ei5',
       '捷豹XE', '哈弗H6', '高尔夫(进口)', '奥迪TT', '一汽-大众CC', '索纳塔八', '雅阁',
       '荣威350', '西玛', '马自达CX-5', '奥迪A4L', '驭胜S330', '雷克萨斯IS', '英菲尼迪QX',
       '思铂睿', '睿翼', '长安CS75', '凯迪拉克CT6', '明锐', '奔驰C级AMG', '荣威RX3',
       '远景SUV', '阿特兹', '劲客', '指南者(进口)', '东南DX3', '途观', '自由光', '欧蓝德', '博瑞',
       '菲翔', '巴博斯G级', '北京现代ix35', '宝骏560', '荣威RX5', '众泰T700', '君威', '迈腾',
       '指南者', '轩逸', '君越', '宝马3系GT', '别克GL8', '名图', '凯迪拉克XTS', '传祺GA3S视界',
       '众泰T600', '楼兰', '长安CX70', '雷凌', 'Polo', '奔驰S级AMG', '奇骏', '冠道',
       '昂科威', '撼路者', '奔驰C级(进口)', '沃尔沃XC60', '哈弗H9', '发现', '传祺GS8', '奥迪Q7',
       '皇冠', '奔驰E级', '阿斯顿·马丁DB9', '普拉多', '瑞虎3', '宝骏730', '名爵6', '锋范',
       '奔驰A级AMG', '雪铁龙C5', '科鲁兹', '林肯MKZ', '辉昂', '林肯大陆', '马自达CX-4',
       '宝马X3(进口)', '克莱斯勒300C(进口)', '宝马1系(进口)', '奔腾X80', '奔驰S级',
       '马自达3Axela昂克赛拉', '斯帕可', '传祺GA8', '马自达3', '帝豪GL', '奔驰SLK级',
       '英菲尼迪Q50L', '瑞风S7', '夏朗', '大切诺基SRT', '奥迪A3', '保时捷718', '观致3',
       'Arteon', '奥迪S5', '哈弗H6Coupe', '起亚K3', '宝马4系', 'Stelvio', '五菱荣光V',
       '奥迪A3(进口)', '威朗', '骊威', '蓝鸟', '比亚迪S6', '雷克萨斯ES', '劲炫ASX', '途达',
       '918Spyder', 'Cayenne', '奔驰CLS级AMG', '凯迪拉克XT5', '英菲尼迪Q50', '瑞纳',
       'DS5LS', '比亚迪F0', '翼神', '揽胜', '比亚迪F6', '阿斯顿·马丁DB11', '马自达6',
       '标致408', '维特拉', '雷克萨斯RX', '欧陆', '缤智', '长城V80', '世嘉', '莲花L3', '探界者',
       '奔驰G级AMG', '城市', '宝马X3', '锐志', '标致508', '发现神行', '欧尚', '英菲尼迪QX60',
       'SprinterTrueno', '雪铁龙C3-XR', 'Urus', '睿骋CC', '传祺GE3', 'Ghibli',
       '奔驰SL级', '奥迪A5', '宝马5系(进口)', '荣威550', '奥德赛', '探险者', '宝马M4',
       '雷克萨斯NX', '奥迪Q3', '伽途im8', '传祺GS4', '讴歌RDX(进口)', '奔驰GLE', '宝来',
       '812Superfast', '全顺', '陆风X7', '总裁', '阳光', '揽胜运动版', '日产GT-R',
       '雷克萨斯LX', '大7MPV', '途昂', '迈巴赫S级', '揽胜极光(进口)', '奔腾B50', '奥迪S8',
       '马自达CX-7', 'Boxster', '长安CS95', '奔驰E级(进口)', '起亚K2', '挑战者SRT',
       '迈锐宝XL', '晶锐', '前途K50', '速尊', '法拉利488', '宝沃BX5', '威驰', '欧诺',
       '奔驰A级(进口)', '帕萨特', '逸动', '蔚来ES8', '远景X3', '都灵', '朗行', 'allroad',
       '艾瑞泽7', '威航', '传祺GS5', '揽胜星脉', '瑞风M3', '飞度', '沃尔沃V90', '讴歌RLX',
       '奔驰GLC(进口)', '智跑', '悦纳', '丘比特', '凌派', '宝马2系多功能旅行车', '全新胜达', '幻影',
       '雷克萨斯RX经典', '驰鹏', 'CaliforniaT', '福克斯(进口)', 'MINICOUPE',
       'GTC4Lusso', 'smartfortwo', '荣威W5', 'ALFA147', '牧马人', '大众CC',
       '悦翔V7', '宝马M8', '宝马M3', '标致5008', '蔚揽', '捷达', '荣威360',
       '凯迪拉克XTS(海外)', '迈锐宝(海外)', '大7SUV', '宝马X4', '荣威RX8', '奔驰GLA', '斯汀格',
       '森林人', '讴歌CDX', '柯迪亚克', '众泰Z300', '哈弗H8', '哈弗H2', '宝马6系GT',
       '马自达MX-5', '高尔夫', '凯迪拉克SRX', '沃尔沃XC40', '福睿斯', '朗动', '起亚K5',
       '沃尔沃S60', '中华骏捷FRV', '悦翔', '奥迪SQ5', '标致308', '锐腾', '勇士',
       '宝马3系(进口)', '雷克萨斯GS', '途锐', 'V12Vantage', '标致308S', '创酷', '宝骏310W',
       '宝马5系GT', '凯迪拉克ATS(进口)', '逍客', '东风风光580', 'Vanquish', '速派', '辉腾',
       '奥迪A8', '林肯MKX', '凯迪拉克CTS(进口)', '林肯MKC', '赛拉图', 'Levante',
       '沃尔沃S90', '东南DX7', '宋MAX', '中华V3', 'Elise', '沃尔沃S90(进口)', '科帕奇',
       '长安之星3', '奥迪Q8', 'mu-X牧游侠', '五菱宏光S3', '奔驰G级', '甲壳虫', 'Agera',
       '长安CS15', '宝马X6M', '绅宝CC', 'CrossBlue', '奥迪RS7', '五菱荣光小卡',
       '奔驰E级AMG', '奔驰GLK级', 'WEYVV5', '赛欧', '帕杰罗·劲畅', '凯旋', '迈凯伦P1', '尚酷',
       'DS6', '瑞虎5', '优6SUV', '宝马X1', '凌渡', '金牛座', '领动', '宝骏510',
       'MINICLUBMAN', '翼虎', '艾力绅', '奔驰CLS级', '凯迪拉克CT6PLUG-IN', '发现神行(进口)',
       '捷恩斯', '起亚K4', '标致2008', '迈凯伦540C', 'Cayman', '宝马1系', '宝马6系',
       '宝马M2', '奥迪S7', '马自达2劲翔', '五菱宏光', '经典全顺', '巴博斯S级', '欧蓝德(进口)',
       '日产D22', '标致307', '桑塔纳', '东风A9', '丰田C-HR(海外)', '斯巴鲁WRX']


